nc: 80
depth_multiple: 1.0
width_multiple: 1.0
act: nn.SiLU()
backbone:
 - [-1,1, Conv, [24,3,2]] #0-P1/2
 - [-1,1, Conv, [39,3,2]] #1-P2/4
 - [-1,1, MambaVisionLayer, [39,3, 2,8]]
 - [-1,1, Conv_LSTM, [39]]
 - [-1,1, Conv, [48,3,2]] #4-P3/8
 - [-1,2, C2f, [48,True]]
 - [-1,1, Conv_LSTM, [48]]
 - [-1,1, Conv, [72,3,2]] #7-P4/16
 - [-1,2, C2f, [72,True]]
 - [-1,1, Conv_LSTM, [72]]
 - [-1,1, Conv, [90,3,2]] #10-P5/16
 - [-1,2, C2f, [90,True]]
 - [-1,1, Conv_LSTM, [90]]
 - [-1,1, SPPF, [90,5]]
head:
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
 - [-1,1,C2f, [192]]
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
 - [-1,1,C2f, [96]] # P3/8-small
 - [-1, 1, Conv, [96, 3, 2]]
 - [[-1, 16], 1, Concat, [1]] # cat head P4
 - [-1,1,C2f, [192]] # P4/16-Medium
 - [-1, 1, Conv, [192, 3, 2]]
 - [[-1, 13], 1, Concat, [1]] # cat head P5
 - [-1,1,C2f, [384]] # P5/32-Large
 - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
