nc: 80
depth_multiple: 1.0
width_multiple: 1.0
act: nn.SiLU()
backbone:
 - [-1,1, Conv, [16,3,2]] #0-P1/2
 - [-1,1, Conv, [26,3,2]] #1-P2/4
 - [-1,1, MambaVisionLayer, [26,2, 2,8]]
 - [-1,1, Conv_LSTM, [26]]
 - [-1,1, Conv, [34,3,2]] #4-P3/8
 - [-1,1, MambaVisionLayer, [34,3, 2,8]]
 - [-1,1, Conv_LSTM, [34]]
 - [-1,1, Conv, [42,3,2]] #7-P4/16
 - [-1,1, MambaVisionLayer, [42,2, 2,8]]
 - [-1,1, Conv_LSTM, [42]]
 - [-1,1, Conv, [63,3,2]] #10-P5/16
 - [-1,1, MambaVisionLayer, [63,1, 4,8]]
 - [-1,1, Conv_LSTM, [63]]
 - [-1,1, SPPF, [63,5]]
head:
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
 - [-1,1,C2f, [128]]
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
 - [-1,1,C2f, [64]] # P3/8-small
 - [-1, 1, Conv, [64, 3, 2]]
 - [[-1, 16], 1, Concat, [1]] # cat head P4
 - [-1,1,C2f, [128]] # P4/16-Medium
 - [-1, 1, Conv, [128, 3, 2]]
 - [[-1, 13], 1, Concat, [1]] # cat head P5
 - [-1,1,C2f, [256]] # P5/32-Large
 - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
