nc: 80
depth_multiple: 1.0
width_multiple: 1.0
act: nn.SiLU()
backbone:
 - [-1,1, Conv, [32,3,2]] #0-P1/2
 - [-1,1, Conv, [48,3,2]] #1-P2/4
 - [-1,3, C2f, [48,True]]
 - [-1,1, Conv_LSTM, [48]]
 - [-1,1, Conv, [96,3,2]] #4-P3/8
 - [-1,2, C2f, [96,True]]
 - [-1,1, Conv_LSTM, [96]]
 - [-1,1, Conv, [144,3,2]] #7-P4/16
 - [-1,1, C2f, [144,True]]
 - [-1,1, Conv_LSTM, [144]]
 - [-1,1, Conv, [252,3,2]] #10-P5/16
 - [-1,2, C2f, [252,True]]
 - [-1,1, Conv_LSTM, [252]]
 - [-1,1, SPPF, [252,5]]
head:
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
 - [-1,1,C2f, [256]]
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
 - [-1,1,C2f, [128]] # P3/8-small
 - [-1, 1, Conv, [128, 3, 2]]
 - [[-1, 16], 1, Concat, [1]] # cat head P4
 - [-1,1,C2f, [256]] # P4/16-Medium
 - [-1, 1, Conv, [256, 3, 2]]
 - [[-1, 13], 1, Concat, [1]] # cat head P5
 - [-1,1,C2f, [512]] # P5/32-Large
 - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
