nc: 80
depth_multiple: 1.0
width_multiple: 1.0
act: nn.SiLU()
backbone:
 - [-1,1, Conv, [40,3,2]] #0-P1/2
 - [-1,1, Conv, [40,3,2]] #1-P2/4
 - [-1,1, MambaVisionLayer, [40,3, 2,8]]
 - [-1,1, Conv_LSTM, [40]]
 - [-1,1, Conv, [40,3,2]] #4-P3/8
 - [-1,1, MambaVisionLayer, [40,1, 3,8]]
 - [-1,1, Conv_LSTM, [40]]
 - [-1,1, Conv, [60,3,2]] #7-P4/16
 - [-1,1, MambaVisionLayer, [60,3, 4,8]]
 - [-1,1, Conv_LSTM, [60]]
 - [-1,1, Conv, [90,3,2]] #10-P5/16
 - [-1,1, MambaVisionLayer, [90,2, 6,8]]
 - [-1,1, Conv_LSTM, [90]]
 - [-1,1, SPPF, [90,5]]
head:
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
 - [-1,1,C2f, [320]]
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
 - [-1,1,C2f, [160]] # P3/8-small
 - [-1, 1, Conv, [160, 3, 2]]
 - [[-1, 16], 1, Concat, [1]] # cat head P4
 - [-1,1,C2f, [320]] # P4/16-Medium
 - [-1, 1, Conv, [320, 3, 2]]
 - [[-1, 13], 1, Concat, [1]] # cat head P5
 - [-1,1,C2f, [640]] # P5/32-Large
 - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
