nc: 80
depth_multiple: 1.0
width_multiple: 1.0
act: nn.SiLU()
backbone:
 - [-1,1, Conv, [24,3,2]] #0-P1/2
 - [-1,1, Conv, [31,3,2]] #1-P2/4
 - [-1,3, WaveMLPLayer, [31]]
 - [-1,1, Conv_LSTM, [31]]
 - [-1,1, Conv, [46,3,2]] #4-P3/8
 - [-1,1, MambaVisionLayer, [46,2, 2,8]]
 - [-1,1, Conv_LSTM, [46]]
 - [-1,1, Conv, [57,3,2]] #7-P4/16
 - [-1,1, MaxVitAttentionPairCl, [57]]
 - [-1,1, Conv_LSTM, [57]]
 - [-1,1, Conv, [99,3,2]] #10-P5/16
 - [-1,1, MambaVisionLayer, [99,2, 2,8]]
 - [-1,1, Conv_LSTM, [99]]
 - [-1,1, SPPF, [99,5]]
head:
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
 - [-1,1,C2f, [192]]
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
 - [-1,1,C2f, [96]] # P3/8-small
 - [-1, 1, Conv, [96, 3, 2]]
 - [[-1, 16], 1, Concat, [1]] # cat head P4
 - [-1,1,C2f, [192]] # P4/16-Medium
 - [-1, 1, Conv, [192, 3, 2]]
 - [[-1, 13], 1, Concat, [1]] # cat head P5
 - [-1,1,C2f, [384]] # P5/32-Large
 - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
