nc: 80
depth_multiple: 1.0
width_multiple: 1.0
act: nn.SiLU()
backbone:

 - [-1,2, WaveMLPLayer, [64,5,4,2]]
 - [-1,1, Conv_LSTM, [64]]
 - [-1,2, WaveMLPLayer, [128,5,2,2]]
 - [-1,1, Conv_LSTM, [128]]
 - [-1,4, WaveMLPLayer, [320,5,2,2]]
 - [-1,1, Conv_LSTM, [320]]
 - [-1,2, WaveMLPLayer, [512,5,2,2]]
 - [-1,1, Conv_LSTM, [512]]
 - [-1,1, SPPF, [512,5]]
head:
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
 - [-1,1,C2f, [320]]
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
 - [-1,1,C2f, [160]] # P3/8-small
 - [-1, 1, Conv, [160, 3, 2]]
 - [[-1, 11], 1, Concat, [1]] # cat head P4
 - [-1,1,C2f, [320]] # P4/16-Medium
 - [-1, 1, Conv, [320, 3, 2]]
 - [[-1, 8], 1, Concat, [1]] # cat head P5
 - [-1,1,C2f, [320]] # P5/32-Large
 - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)

