nc: 80
depth_multiple: 1.0
width_multiple: 1.0
act: nn.SiLU()
backbone:
 - [-1,1, Conv, [44,3,2]] #0-P1/2
 - [-1,1, Conv, [77,3,2]] #1-P2/4
 - [-1,2, C2f, [77,True]]
 - [-1,1, Conv_LSTM, [77]]
 - [-1,1, Conv, [102,3,2]] #4-P3/8
 - [-1,2, C2f, [102,True]]
 - [-1,1, Conv_LSTM, [102]]
 - [-1,1, Conv, [140,3,2]] #7-P4/16
 - [-1,1, MambaVisionLayer, [140,1, 2,8]]
 - [-1,1, Conv_LSTM, [140]]
 - [-1,1, Conv, [140,3,2]] #10-P5/16
 - [-1,1, MaxVitAttentionPairCl, [140]]
 - [-1,1, Conv_LSTM, [140]]
 - [-1,1, SPPF, [140,5]]
head:
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
 - [-1,1,C2f, [352]]
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
 - [-1,1,C2f, [176]] # P3/8-small
 - [-1, 1, Conv, [176, 3, 2]]
 - [[-1, 16], 1, Concat, [1]] # cat head P4
 - [-1,1,C2f, [352]] # P4/16-Medium
 - [-1, 1, Conv, [352, 3, 2]]
 - [[-1, 13], 1, Concat, [1]] # cat head P5
 - [-1,1,C2f, [352]] # P5/32-Large
 - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
