nc: 80
depth_multiple: 1.0
width_multiple: 1.0
act: nn.SiLU()
backbone:
 - [-1,1, Conv, [20,3,2]] #0-P1/2
 - [-1,1, Conv, [35,3,2]] #1-P2/4
 - [-1,3, C2f, [35,True]]
 - [-1,1, Conv_LSTM, [35]]
 - [-1,1, Conv, [54,3,2]] #4-P3/8
 - [-1,3, C2f, [54,True]]
 - [-1,1, Conv_LSTM, [54]]
 - [-1,1, Conv, [71,3,2]] #7-P4/16
 - [-1,1, MaxVitAttentionPairCl, [71]]
 - [-1,1, Conv_LSTM, [71]]
 - [-1,1, Conv, [142,3,2]] #10-P5/16
 - [-1,1, MaxVitAttentionPairCl, [142]]
 - [-1,1, Conv_LSTM, [142]]
 - [-1,1, SPPF, [142,5]]
head:
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
 - [-1,1,C2f, [160]]
 - [-1, 1, nn.Upsample, [None, 2, nearest]]
 - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
 - [-1,1,C2f, [80]] # P3/8-small
 - [-1, 1, Conv, [80, 3, 2]]
 - [[-1, 16], 1, Concat, [1]] # cat head P4
 - [-1,1,C2f, [160]] # P4/16-Medium
 - [-1, 1, Conv, [160, 3, 2]]
 - [[-1, 13], 1, Concat, [1]] # cat head P5
 - [-1,1,C2f, [160]] # P5/32-Large
 - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
